# Exercise 1. - Getting and Knowing your Data

This time we are going to pull data directly from the internet.
Special thanks to: https://github.com/justmarkham for sharing the dataset and materials.

Check out [Occupation Exercises Video Tutorial](https://www.youtube.com/watch?v=W8AB5s-L3Rw&list=PLgJhDSE2ZLxaY_DigHeiIDC1cD09rXgJv&index=4) to watch a data scientist go through the exercises

### Step 1. Import the necessary libraries

In [1]:
import pandas as pd

### Step 2. Import the dataset from this [address](https://raw.githubusercontent.com/justmarkham/DAT8/master/data/u.user).

### Step 3. Assign it to a variable called users and use the 'user_id' as index

In [ ]:
import pandas as pd
users = pd.read_csv('https://raw.githubusercontent.com/justmarkham/DAT8/master/data/u.user', sep="|", index_col=0)
users.head(3)

### Step 4. See the first 25 entries

In [ ]:
import pandas as pd
users = pd.read_csv('https://raw.githubusercontent.com/justmarkham/DAT8/master/data/u.user', sep="|", index_col=0)
users.head(25)

### Step 5. See the last 10 entries

In [2]:
import pandas as pd
users = pd.read_csv('https://raw.githubusercontent.com/justmarkham/DAT8/master/data/u.user', sep="|", index_col=0)
users.tail(10)

         age gender     occupation zip_code
user_id
934       61      M       engineer    22902
935       42      M         doctor    66221
936       24      M          other    32789
937       48      M       educator    98072
938       38      F     technician    55038
939       26      F        student    33319
940       32      M  administrator    02215
941       20      M        student    97229
942       48      F      librarian    78209
943       22      M        student    77841

### Step 6. What is the number of observations in the dataset?

In [3]:
import pandas as pd
users = pd.read_csv('https://raw.githubusercontent.com/justmarkham/DAT8/master/data/u.user', sep="|", index_col=0)
print(len(users))

943

### Step 7. What is the number of columns in the dataset?

In [5]:
i=0
for columns in users.columns:
    i+=1
print(i)

4

### Step 8. Print the name of all the columns.

In [ ]:
for columns in users.columns:
    print(columns)

### Step 9. How is the dataset indexed?

In [6]:
users.index

Index([  1,   2,   3,   4,   5,   6,   7,   8,   9,  10,
       ...
       934, 935, 936, 937, 938, 939, 940, 941, 942, 943],
      dtype='int64', name='user_id', length=943)

### Step 10. What is the data type of each column?

In [13]:
users.dtypes
users['gender'] = users['gender'].convert_dtypes(str)
users['occupation'] = users['occupation'].convert_dtypes(str)
users['zip_code'] = users['zip_code'].convert_dtypes(str)
users.dtypes

age                    int64
gender        string[python]
occupation    string[python]
zip_code      string[python]
dtype: object

### Step 11. Print only the occupation column

In [ ]:
#df = pd.DataFrame(users)
#print(df['occupation'].head(3))
users.occupation.head(10)

user_id
1    technician
2         other
3        writer
Name: occupation, dtype: object

### Step 12. How many different occupations are in this dataset?

In [18]:
users.occupation.nunique()

21

### Step 13. What is the most frequent occupation?

In [19]:
users.occupation.value_counts().head(1)

occupation
student    196
Name: count, dtype: Int64

### Step 14. Summarize the DataFrame.

In [20]:
users.describe()

              age
count  943.000000
mean    34.051962
std     12.192740
min      7.000000
25%     25.000000
50%     31.000000
75%     43.000000
max     73.000000

### Step 15. Summarize all the columns

In [22]:
sall = users.describe(include='all')
sall

               age gender occupation zip_code
count   943.000000    943        943      943
unique         NaN      2         21      795
top            NaN      M    student    55414
freq           NaN    670        196        9
mean     34.051962    NaN        NaN      NaN
std      12.192740    NaN        NaN      NaN
min       7.000000    NaN        NaN      NaN
25%      25.000000    NaN        NaN      NaN
50%      31.000000    NaN        NaN      NaN
75%      43.000000    NaN        NaN      NaN
max      73.000000    NaN        NaN      NaN

### Step 16. Summarize only the occupation column

In [27]:
occs = users['occupation'].describe()
occs

count         943
unique         21
top       student
freq          196
Name: occupation, dtype: object

### Step 17. What is the mean age of users?

In [31]:
afterdot = 2 # number of digits after the decimal point
MeanAge = users['age'].mean()
print(MeanAge.round(afterdot))

34.05

### Step 18. What is the age with least occurrence?

In [35]:
i = 1
t = []
b = 1
least = 0
while(b):
    for users['age'] in users['age']:
        if users['age'] == i:
            b=0
            least = i
            break 
for users['age'] in users['age']:
    if users['age'] == least:
        t.append(users['age'])
print(t)
print(i)
#users['age'].value_counts().tail(10)

ValueError: The truth value of a Series is ambiguous. Use a.empty, a.bool(), a.item(), a.any() or a.all().